tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscil_IBCoef_Effect/ImmersedCyl-Sin-Re39-Mesh56320-IBPt05/Allrun-parallel
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#rm -rf 0

#cp -r 0.org 0

paraFoam -touch

runApplication blockMesh

runApplication decomposePar -force

application=`getApplication`


runParallel $application

runApplication reconstructParMesh -newTimes

runApplication reconstructPar


# ----------------------------------------------------------------- end-of-file
